//===================================================================================================================================
// インクルード
//===================================================================================================================================
#include "AppProc.h"

//===================================================================================================================================
// コンストラクタ
//===================================================================================================================================
AppProc::AppProc(HWND hWnd,
	ID3D11Device *_device,
	ID3D11DeviceContext *_deviceContext,
	IDXGISwapChain *_swapChain,
	ID3D11RenderTargetView *_renderTargetView)
{
	// DX11関連
	device				= _device;
	deviceContext		= _deviceContext;
	swapChain			= _swapChain;
	renderTargetView	= _renderTargetView;

	// 初期化
	imGuiManager = new ImGuiManager(hWnd, _device, _deviceContext);

}

//===================================================================================================================================
// デストラクタ
//===================================================================================================================================
AppProc::~AppProc()
{
	// 終了処理
	SAFE_DELETE(imGuiManager)
}

//===================================================================================================================================
// 更新処理
//===================================================================================================================================
void AppProc::Update()
{
	// [ImGui]新しいフレームの作成
	imGuiManager->CreateNewFrame();
		
	// [ImGui]テスト
	imGuiManager->test();
}

//===================================================================================================================================
// 描画処理
//===================================================================================================================================
void AppProc::Draw(ID3D11RenderTargetView *_renderTargetView)
{
	ImGui::Render();
	deviceContext->OMSetRenderTargets(1, &_renderTargetView, NULL);
	float clear_color[4] = { 0.45f, 0.55f, 0.60f, 1.00f };
	deviceContext->ClearRenderTargetView(_renderTargetView, clear_color);
	ImGui_ImplDX11_RenderDrawData(ImGui::GetDrawData());

	swapChain->Present(1, 0);
}