#pragma once
//===================================================================================================================================
// インクルード
//===================================================================================================================================
#include "Main.h"

//===================================================================================================================================
// マクロ定義
//===================================================================================================================================
namespace windowNS
{
	const int WINDOW_WIDTH = 1920;
	const int WINDOW_HEIGHT = 1080;
}

//===================================================================================================================================
// クラス
//===================================================================================================================================
class Window
{
public:
	Window();
	~Window() {};

	// ウインドウプロシージャ
	LRESULT WndProc(HWND hWnd, UINT message, WPARAM wParam, LPARAM lParam);

	// ウインドの初期化
	HRESULT Init(HINSTANCE hInstance);

	// ウインドの表示
	void ShowWnd(int nCmdShow);

	// ウインドハンドルの取得
	HWND GetWindowHwnd();

	// リサイズフラグの取得
	bool GetReSizeFlg();
	// リサイズフラグの設定
	void SetReSizeFlg(bool _reSizeFlg);

	// リサイズデータの取得
	WPARAM GetwParam();
	LPARAM GetlParam();

private:
	WNDCLASSEX wcex;		// ウィンドウクラス構造体
	HWND hWnd;				// ウィンドウハンドル
	RECT bounds, client;	// RECT構造体
	bool reSizeFlg;			// リサイズフラグ
	WPARAM wParam;			// リサイズ用
	LPARAM lParam;			// リサイズ用
};